%--------------------------------------------------------------------------
%   wave = range_velocity_gate_pull_off(sig,fc,PRT,N_prt,R_range,V_range,fs)
%--------------------------------------------------------------------------
%   功能：
%   距离-速度联合拖引干扰
%--------------------------------------------------------------------------
%   输入：
%           sig                 雷达回波
%           fc                  载频
%           PRT                 雷达PRT
%           N_prt               PRT数量  N_prt*PRT=总时间
%           R_range             [R_st,R_en] 距离拖引范围
%           V_range             [V_st,V_range] 速度拖引范围
%           fs                  表达频率
%   输出：
%           echo                雷达回波
%--------------------------------------------------------------------------
function echo = range_velocity_gate_pull_off(sig,fc,PRT,N_prt,R_range,V_range,fs)
c = 3e8;
T = 1/fs;
lambda = c/fc;
N = round(PRT/T);
R_max = time2range(PRT,c);                                                  %计算距离最大输入值
sig_len = length(sig);
sig_T = T*sig_len;                                                          %信号持续时间
sig_range = time2range(sig_T,c);
PRF = 1/PRT;
vmax = PRF*lambda/2/2;
vmin = -vmax; 

%--------------------------------------------------------------------------
%   变量判决区域
%--------------------------------------------------------------------------
if PRT/T - round(PRT/T) ~= 0 
    disp('PRT和fs采样率不是整数 PRT*fs应为整数')
    echo = nan;
    return
end

if length(sig)*T > PRT
    disp('信号长度＞PRT时间,采集信号不合理')
    echo = nan;
    return
end

if max(R_range) > (R_max-sig_range)
    disp('距离超出PRT范围')
    echo = nan;
    return
end

if max(V_range) > vmax || min(V_range) < vmin
    disp('速度超出雷达测速范围')
    echo = nan;
    return
end

disp(['距离输入范围:' num2str([0 R_max-sig_range])])
disp(['速度输入范围:' num2str([vmin vmax])])

%--------------------------------------------------------------------------
%   构造回波信号
%--------------------------------------------------------------------------
sig_prt = zeros(N,1);
sig_prt(1:sig_len) = sig;

%--------------------------------------------------------------------------
%   信号缓冲区
%--------------------------------------------------------------------------
echo = zeros(N,N_prt);

%--------------------------------------------------------------------------
%   计算距离拖引范围
%--------------------------------------------------------------------------
R_range = linspace(R_range(1),R_range(2),N_prt);
delay_N = round(range2time(R_range,c)/T);

%--------------------------------------------------------------------------
%   距离拖引
%--------------------------------------------------------------------------
for idx = 1:N_prt
    echo(:,idx) = circshift(sig_prt,delay_N(idx));
end

%--------------------------------------------------------------------------
%   速度拖引
%--------------------------------------------------------------------------
V_range = linspace(V_range(1),V_range(2),N_prt);                            %速度线性变化
% fd = 2 * V_range / lambda;                                                %多普勒变化

%--------------------------------------------------------------------------
%   速度*时间是单位PRT增加的距离,积分后是绝对距离
%--------------------------------------------------------------------------
phi = exp(1j.*cumsum(2*V_range.*PRT)/lambda*2*pi);
echo = echo .* phi;                                                         %添加速度拖引


end
