%--------------------------------------------------------------------------
%   ECEF_XYZ = lla2ecef(lla)
%--------------------------------------------------------------------------
%   功能：
%   从纬经高转ECEF坐标系
%--------------------------------------------------------------------------
%   输入:
%           lla = [lat1 lat2 lat3 ...
%                  lon1 lon2 lon3 ...
%                  alt1 alt2 alt3 ...]
%           其中：
%                           lat           	纬度
%                           lon           	经度
%                           alt           	高度
%                                           按照列向量排
%   输出:
%           ECEF_XYZ = [x y z]'
%                           其中:
%                           x				ECEF坐标系下的x
%			                y				ECEF坐标系下的y
%			                z				ECEF坐标系下的z
%--------------------------------------------------------------------------
%   例子:
%   ECEF_XYZ = geo.lla2ecef([0,45,1000])
%--------------------------------------------------------------------------
function ECEF_XYZ = lla2ecef(lla)
lat = lla(1,:);lon = lla(2,:);alt = lla(3,:);
WGS84_A = 6378137.0;                                % 长半轴 
WGS84_f = 1/298.257223565;                          % 扁率 
WGS84_E2 = WGS84_f * (2 - WGS84_f);                 % 第一偏心率平方
N = WGS84_A ./ sqrt(1 - WGS84_E2 .* sind(lat) .* sind(lat));
x = (N + alt) .* cosd(lat) .* cosd(lon);
y = (N + alt) .* cosd(lat) .* sind(lon);
z = (N * (1 - WGS84_f) * (1 - WGS84_f) + alt) .* sind(lat);
ECEF_XYZ = [x;y;z];
end