%--------------------------------------------------------------------------
%   pos = radar2xyz(azimuth_deg, elevation_deg, range)
%--------------------------------------------------------------------------
%   功能：
%   将相控阵雷达的极坐标下的(方位,俯仰,半径)转换为x,y,z坐标
%   阵列位于y-z平面内,指向x轴为正向
%   常见于查看时域复信号，傅里叶变换后信号的幅度和相位信息
%--------------------------------------------------------------------------
%   输入：
%           azimuth_deg     方位角(°)，范围0°~360°,从正北方向顺时针测量
%           elevation_deg   俯仰角(°)，范围-90°~90°，正值表示高于水平面
%           range           目标到达雷达的直线距离(m)
%   输出：
%           pos = [x y z]'  直角坐标系下的坐标值
%--------------------------------------------------------------------------
%   例子：
%   暂无
%--------------------------------------------------------------------------
function pos = polar2xyz(azimuth_deg, elevation_deg, range)
x =  range * cosd(elevation_deg) * cosd(azimuth_deg);
y = -range * cosd(elevation_deg) * sind(azimuth_deg);
z =  range * sind(elevation_deg);
pos = [x y z].';
end