%--------------------------------------------------------------------------
%   output = am_mod(sig_in,fc,fs)
%--------------------------------------------------------------------------
%   功能：
%   模拟信号AM调制
%--------------------------------------------------------------------------
%   输入:
%           sig_in          调制信号
%           fc              载频
%           fs              表达频率
%--------------------------------------------------------------------------
%   输出:
%           sig_out         输出信号
%--------------------------------------------------------------------------
%   例子:
%   fc = 1e6;
%   fs = 1e9;
%   T = 1/fs;
%   t = 0:T:1e-3-T;
%   sig_in = 1+0.5*cos(2*pi*10e3*t);
%   sig_out = cm.am_mod(sig_in,fc,fs);
%--------------------------------------------------------------------------
function sig_out = am_mod(sig_in,fc,fs)
% sig_out = ammod(sig_in,fc,fs);                                              %matlab 自带am调制
T = 1/fs;
t_axis = (0:length(sig_in)-1).*T;
sig_fc = cos(t_axis.*2*pi*fc);
sig_out = sig_in.*sig_fc;
sig_out = sig_out(:);                                                       %输出实部和matlab自带一致
end