%--------------------------------------------------------------------------
%   sig_out = fm_mod(sig_in,fc,fs,freqdev)
%--------------------------------------------------------------------------
%   功能：
%   模拟信号FM调制
%--------------------------------------------------------------------------
%   输入:
%           sig_in          调制信号
%           fc              载频
%           fs              表达频率
%           freqdev         调频斜率
%--------------------------------------------------------------------------
%   输出:
%           sig_out         输出信号
%--------------------------------------------------------------------------
%   例子:
%   Fs = 2000;                  % 采样频率
%   Ts = 1 / Fs;
%   L = 2000;                   % 取2000采样点，1s
%   t = (0 : L - 1) * Ts;
% 
%   kf = 45;                    % 调频灵敏度
%   fm = 4;                     % 基带信号频率
%   fc = 50;                    % 载波频率
%   mt = cos(2 * pi * fm * t);  % 基带信号
% 
%   cm.fm_mod(mt,fc,Fs,kf);
%--------------------------------------------------------------------------
function sig_out = fm_mod(sig_in,fc,fs,freqdev)
% sig_out1 =  fmmod(sig_in,fc,fs,freqdev);sig_out1 = sig_out1(:);
sig_in = sig_in(:);
T = 1/fs;
t_axis = ((0:length(sig_in)-1)*T)';

sig_out = cos(2*pi*fc*t_axis + 2*pi*freqdev*cumsum(sig_in) * T);