%--------------------------------------------------------------------------
%   arrayd2lambda(d,fc_in)
%--------------------------------------------------------------------------
%   功能：
%   从阵列间距计算波长(空间奈奎斯特采样定理)
%--------------------------------------------------------------------------
%   输入：
%           d                   阵列间距
%           fc_in               载频输入
%--------------------------------------------------------------------------
%   例子：
%   暂无
%--------------------------------------------------------------------------
function arrayd2lambda(d,fc_in)
c = 3e8;
lambda = 2*d;
fc = c/lambda;
if nargin == 1
    disp(['阵列对应载频: ' num2str(fc/1e6) ' Mhz'])
    disp(['阵列对应波长: ' num2str(lambda) ' m'])
elseif nargin == 2
    lambda_in = c/fc_in;
    angle_deg = d/lambda_in*360;
    disp(['目标围绕阵列从法线旋转90°，两通道相位差变化:' num2str(angle_deg) '°'])
end


end