%--------------------------------------------------------------------------
%   [fd,dop_fix_sig] = bpsk_doppler_est(sig,fs,down_N)
%--------------------------------------------------------------------------
%   功能：
%   估计bpsk调制下的多普勒信息
%--------------------------------------------------------------------------
%   输入:
%           sig         输入信号
%           fs          采样速率
%   输出:
%           fd          多普勒频率
%--------------------------------------------------------------------------
function fd = bpsk_doppler_est(sig,fs)

f_scale = 50;
sig = sig(:).^2;                                                            %2项调制翻转过去

%--------------------------------------------------------------------------
%   阈值去掉多余部分
%--------------------------------------------------------------------------
sig_abs = abs(sig);
th = max(sig_abs)/2;
index = sig_abs<th;
sig(index) = 0;

%--------------------------------------------------------------------------
%   粗略估计多普勒频率
%--------------------------------------------------------------------------
[value,f_axis] = pspectrum(sig,fs);
[~,index] = max(value);
f_est = f_axis(index);


if nargout == 0 
    figure(1)
    subplot(511);
    pspectrum(sig,fs./2);
    drawnow
end
%--------------------------------------------------------------------------
%   自动估计
%   精度从1Hz 一直到1e-6Hz
%--------------------------------------------------------------------------
N = 4;
idx = N;

while(idx)
    disp(['第' num2str(N-idx+1) '/' num2str(N) '估计，精度: ' num2str(10^(idx-N))])
    f = f_est - f_scale/10^(N-idx) : 10^(idx-N) : f_est + f_scale/10^(N-idx);       %缩放频率轴
    f_sig = exp(-1j.*2.*pi.*f./fs.*(0:length(sig)-1)');                %手动傅里叶变换
    value = abs(sum(sig.*f_sig,1));
    
    [~,index] = max(value);
    f_est = f(index);
    
    if nargout == 0
        subplot(5,1,N-idx+2)
        plot(f./2,value);grid on
        title(N-idx+1);
        xlabel('频率 Hz');ylabel('幅度')
        drawnow
    end
    idx = idx - 1;

end

fd = f_est / 2;
end
