%--------------------------------------------------------------------------
%   dbf_analyzer(angle_axis,E_dB)
%--------------------------------------------------------------------------
%   功能：
%   DBF性能分析工具
%--------------------------------------------------------------------------
%   输入:
%           angle_axis          角度坐标轴
%           E_dB                天线方向图(dB)
%   输出:
%           angle_point         角度指向角
%           width_3db           3db波束宽度
%           sidelobe_db         主副瓣抑制
%--------------------------------------------------------------------------
function [angle_point,width_3db,sidelobe_db] = dbf_analyzer(angle_axis,E_dB)
%--------------------------------------------------------------------------
%   归一化
%--------------------------------------------------------------------------
norm_dB = E_dB - max(E_dB);                                                 %数据分析用的变量
plot_norm_dB = norm_dB;                                                     %画图用的变量

%--------------------------------------------------------------------------
%   波束指向
%--------------------------------------------------------------------------
[~,max_index] = max(norm_dB);
angle_point = angle_axis(max_index);                                        %对应角度

%--------------------------------------------------------------------------
%   波束宽度
%--------------------------------------------------------------------------
%   左侧搜索-3dB位置
%--------------------------------------------------------------------------
temp_index = max_index;
while(1)
    temp_index = temp_index - 1;
    if norm_dB(temp_index) < -3
        break;
    end
end
left_index = temp_index;

%--------------------------------------------------------------------------
%   右侧搜索-3dB位置
%--------------------------------------------------------------------------
temp_index = max_index;
while(1)
    temp_index = temp_index + 1;
    if norm_dB(temp_index) < -3
        break;
    end
end
right_index = temp_index;

%--------------------------------------------------------------------------
%   用线性插值计算精确-3dB角度
%--------------------------------------------------------------------------
%   左侧
%--------------------------------------------------------------------------
left_3db = (-3-norm_dB(left_index)) ./ (norm_dB(left_index+1)-norm_dB(left_index)) ...
                         .* (angle_axis(left_index+1) - angle_axis(left_index)) + angle_axis(left_index);
%--------------------------------------------------------------------------
%   右侧
%--------------------------------------------------------------------------
right_3db = (norm_dB(right_index-1)+3) ./ (norm_dB(right_index-1)-norm_dB(right_index)) ...
                          .* (angle_axis(right_index) - angle_axis(right_index-1)) + angle_axis(right_index-1);

%--------------------------------------------------------------------------
%   得到波束宽度
%--------------------------------------------------------------------------
width_3db = right_3db - left_3db;                                           %3dB波束宽度

%--------------------------------------------------------------------------
%   主副瓣抑制
%--------------------------------------------------------------------------
%   向左侧搜索拐点
%--------------------------------------------------------------------------
temp_index = max_index;
while(1)
    if norm_dB(temp_index - 1) < norm_dB(temp_index)
        temp_index = temp_index - 1;
    else
        break
    end
end
L_index = temp_index;
%--------------------------------------------------------------------------
%   向右侧搜索拐点
%--------------------------------------------------------------------------
temp_index = max_index;
while(1)
    if norm_dB(temp_index + 1) < norm_dB(temp_index)
        temp_index = temp_index + 1;
    else
        break
    end
end
R_index = temp_index;

%--------------------------------------------------------------------------
%   剔除左右侧拐点，即删除主波束
%--------------------------------------------------------------------------
norm_dB(L_index:R_index) = [];

%--------------------------------------------------------------------------
%   得到最大副瓣
%--------------------------------------------------------------------------
sidelobe_db = max(norm_dB);

%   理论波束宽度
% rad2deg(0.886*2/N/cosd(theta_d))

%   如果没有输出参数画图
if nargout == 0
    %   绘制指向角
    plot(angle_axis,plot_norm_dB);grid on;hold on;
    plot(angle_axis(max_index),3 + plot_norm_dB(max_index),'kv')
    text(angle_axis(max_index),3 + plot_norm_dB(max_index),['   ' num2str(angle_point) '°'])

    %   绘制3dB波束宽度
    plot([left_3db right_3db],[-3 -3],'k+-');
    text(angle_point,-10,[num2str(width_3db) '°'])

    %   绘制主副瓣抑制
    plot([50 50],[0 sidelobe_db],'k+-')
    plot([45 55],[0 0],'k')
    plot([45 55],[sidelobe_db sidelobe_db],'k')
    text(55,sidelobe_db/2,[num2str(sidelobe_db) '°'])
    hold off

    axis([-90 90 -140 10])
    title('波束评估指标参数')
    disp('------------------------------------------------------------------')
    disp(['波束指向: ' num2str(angle_point) '°'])
    disp(['3dB波束宽度: ' num2str(width_3db) '° 左右侧: ' num2str(left_3db) '° ' num2str(right_3db) '°'])
    disp(['副瓣: ' num2str(sidelobe_db)])
    disp('------------------------------------------------------------------')
end
