%--------------------------------------------------------------------------
%   [fd,dop_fix_sig] = est_parabolic_extremum(y1,y2,y3)
%--------------------------------------------------------------------------
%   功能：
%   估计抛物线的极值,默认x1,x2,x3的坐标为-1 0 1
%--------------------------------------------------------------------------
%   输入:
%           y1          第一点y值
%           y2          第二点y值
%           y3          第三点y值
%   输出:
%           xExtr       极值点x坐标
%           yExtr       极值点y坐标
%--------------------------------------------------------------------------
function [xExtr,yExtr] = est_parabolic_extremum(y1,y2,y3)
a = (y1 + y3)/2 - y2;   % 相当于标准定义中A的相反数
b = (y3 - y1)/2;        % 相当于标准定义中B的一半


xExtr = -b / 2/a;          % 极值点的x坐标
yExtr = a*xExtr.^2+b*xExtr+y2; % 极值点的y坐标
end