%--------------------------------------------------------------------------
%   angle_est = iam(sig,fc,L_long)
%--------------------------------------------------------------------------
%   功能：
%   干涉仪测角(interferometric angle measurement)
%   短基线必须满足空间奈奎斯特混叠:L_short = lambda/2
%--------------------------------------------------------------------------
%   输入：
%           sig                 通道1,2,3接收的复信号
%           fc                  载频
%           L_long              长基线,1-3通道的间距
%   输出:
%           angle_est           信号来向角,度
%--------------------------------------------------------------------------
%   例子：
%   暂无
%--------------------------------------------------------------------------
function angle_est = iam(sig,fc,L_long)
lambda = 3e8/fc;
fai21 = angle(sig(2)./sig(1));                                              %2相对于1复相位
fai31 = angle(sig(3)./sig(1));                                              %3相对于1复相位
M = L_long/(lambda/2);                                                      %长短基线比值
k = (M*fai21-fai31)/2/pi;                                                   %相位缠绕倍数

fai31_hat = k*2*pi +fai31;                                                  %相位还原
angle_est = -asind(fai31_hat/2/pi*lambda/L_long);                           %信号来向角
end