%--------------------------------------------------------------------------
%   [H] = kalmus_filter(order,N,N_all)
%--------------------------------------------------------------------------
%   功能：
%   卡尔玛斯滤波器，常用于雷达静止目标剔除，在MTD平面上加入后进行静止目标剔除
%--------------------------------------------------------------------------
%   输入：
%           order       滤波器阶数
%           N           滤波器输出点数
%           N_all       MTD速度轴总点数
%   输出：
%           H_output    卡尔玛斯滤波器+速度轴
%--------------------------------------------------------------------------
%   例子：
%   H_output = kalmus_filter(1.35,5,128)
%--------------------------------------------------------------------------
function H_output = kalmus_filter(order,N,N_all)
if rem(N,2) ~= 1
    disp('N:滤波器长度必须为奇数')
    return
end
if rem(N_all,2) ==1
    disp('N_all:速度轴fft必须为偶数点长')
    return
end
fc = linspace(-0.5,0.5,N);
H1 = sin( pi*order*(fc - 1/2/order) ) ./ (pi*(fc - 1/2/order));
H2 = sin( pi*order*(fc + 1/2/order) ) ./ (pi*(fc + 1/2/order));
H1(isnan(H1))=1;
H2(isnan(H2))=1;
H =abs(H1-H2)';
%--------------------------------------------------------------------------
%   在0速度中心做凹口，其他速度尺度填平
%--------------------------------------------------------------------------
N_one = (N_all-N-1)/2;
H_output = [ones(N_one+1,1).*H(1);H;ones(N_one,1).*H(end)];
%归一化
H_output = H_output - min(H_output) + eps;                                  %后面算db不能搞到0
H_output = H_output./max(H_output);
end
