%--------------------------------------------------------------------------
%   A = matrix_ml(nfft,sig_len)
%--------------------------------------------------------------------------
%   功能：
%   频率因子阵，矩阵形式的傅里叶变换,一般最小二乘时候使用
%--------------------------------------------------------------------------
%   输入:
%           nfft                    fft的点数
%           sig_len                 信号长度
%           A                       输出矩阵A,即为傅里叶变换的矩阵形式
%--------------------------------------------------------------------------
%   例子：
%   sig (L*1)
%   sig_freq = matrix(M,L)*sig;
%--------------------------------------------------------------------------
function A = matrix_ml(nfft,sig_len)
if nfft < sig_len
    disp('注意:只有nfft>=L的时候等效于傅里叶变换')
end
[l,m] = meshgrid((0:sig_len-1),(0:nfft-1));
A = exp(-1j.*2.*pi.*m.*l./nfft);
end

