%--------------------------------------------------------------------------
%   delay = toa_est(sig1,sig2)
%--------------------------------------------------------------------------
%   功能：
%   估计sig1和sig2的时延，如果为负，sig2超前sig1，如果为正值，sig2滞后sig1
%--------------------------------------------------------------------------
%   输入:
%           sig1        第一个信号
%           sig2        第二个信号
%   输出:
%           delay       时延点数
%--------------------------------------------------------------------------
function delay = toa_est(sig1,sig2)
sig1 = abs(sig1(:));
sig2 = abs(sig2(:));

%--------------------------------------------------------------------------
%   时域自相关，频域共轭相乘
%   频域点数不够的情况下，居然把底噪拉平了
%--------------------------------------------------------------------------
y_freq_cov2 = ifft(fft(sig1).*conj(fft(sig2)));
N = numel(y_freq_cov2);
[~,lag] = xcorr(sig1,sig2);
[~,index] = max(y_freq_cov2);

if index > N/2    %2比1超前
    xExrt = est_parabolic_extremum(y_freq_cov2(index-1),...
                          y_freq_cov2(index),...
                          y_freq_cov2(index+1));
    delay = lag(index-1)+xExrt;
else              %2比1之后
    xExrt = est_parabolic_extremum(y_freq_cov2(index-1),...
                          y_freq_cov2(index),...
                          y_freq_cov2(index+1));
    delay = lag(index+N-1)+xExrt;
end

end





%--------------------------------------------------------------------------
%   [fd,dop_fix_sig] = est_parabolic_extremum(y1,y2,y3)
%--------------------------------------------------------------------------
%   功能：
%   估计抛物线的极值,默认x1,x2,x3的坐标为-1 0 1
%--------------------------------------------------------------------------
%   输入:
%           y1          第一点y值
%           y2          第二点y值
%           y3          第三点y值
%   输出:
%           xExtr       极值点x坐标
%           yExtr       极值点y坐标
%--------------------------------------------------------------------------
function [xExtr,yExtr] = est_parabolic_extremum(y1,y2,y3)
a = (y1 + y3)/2 - y2;   % 相当于标准定义中A的相反数
b = (y3 - y1)/2;        % 相当于标准定义中B的一半


xExtr = -b / 2/a;          % 极值点的x坐标
yExtr = a*xExtr.^2+b*xExtr+y2; % 极值点的y坐标
end
