%--------------------------------------------------------------------------
%   waveform2bin(sig,filename)
%--------------------------------------------------------------------------
%   功能：
%   生成
%--------------------------------------------------------------------------
%   输入:
%           sig         输入信号
%           filename    保存文件名
%--------------------------------------------------------------------------
%   例子:
%   waveform2CSG_AWG_bin(sig,'waveform.bin')
%--------------------------------------------------------------------------
function waveform2bin(sig,filename)
max_L = max(abs(sig));

if max_L <= 10 || max_L>=32767
    disp('信号能量过小 或 过大，归一化并缩放到±32767')
    sig = round(sig./max_L.*32767);
else
    disp('信号能量满足要求，直接输出不进行归一化')
    sig = round(sig);
end

temp = [real(sig(:)) imag(sig(:))].';
waveform = temp(:);

f = fopen(filename,'w');
fwrite(f,waveform,'int16','l');
fclose(f);
end